Tekla Open API Reference for Tekla Structures 2025
PolygonWeld.GetLogicalWeld Method
 Gets the logical weld where the weld belongs. Returns false if the weld does not belong to any logical weld.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool GetLogicalWeld(
	ref LogicalWeld LogicalWeld
)
Public Function GetLogicalWeld (
	ByRef LogicalWeld As LogicalWeld
) As Boolean
Parameters
LogicalWeld
Type: Tekla.Structures.Model.LogicalWeld
An initialized logical weld object.
Return Value
Type: Boolean
True if the logical weld was selected correctly; false otherwise.
See Also
Reference
PolygonWeld Class
Tekla.Structures.Model Namespace